<!DOCTYPE html>
<html lang="en">
<head>
  <meta charset="UTF-8">
  <title>PHP基礎編</title>
</head>
<body>
  <p>
    <?php
    // 算術演算子を使った場合の戻り値を出力する
    echo 45 + 18;

    // 改行する
    echo '<br>';

    // 比較演算子を使った場合の戻り値を出力する
    var_dump(45 > 18);
    ?>
  </p>
  <p>
    <?php
    // 等価演算子を使った場合の戻り値を出力する
    var_dump('5' == 5);

    // 改行
    echo '<br>';

    // 厳密等価演算子を使った場合の戻り値を出力する
    var_dump('5' === 5);
    ?>
  </p>
  <p>
    <?php
    // 変数$numに0～４までのランダムな整数を代入する
    $num = mt_rand(0,4);

    // 変数numの値を出力する
    echo $num;

    // 改行
    echo '<br>';

    // 変数numの値が4であれば、「大当たりです」という文字列を出力する
    // 変数numの値が3であれば、「当たりです」という文字列を出力する
    // それ以外の時は「はずれです」という文字列を出力する
    if ($num === 4) {
      # code...
      echo '大当たりです';
    } elseif ($num === 3) {
      echo '当たりです';
    } else {
      echo 'はずれです';
    }
    ?>
  </p>
  <p>
    <?php
    $num = 20;

    // &&（かつ）を記述してすべての条件が成り立つ場合にのみ処理を行う（変数num）
    if ($num > 10 && $num < 30) {
      echo '変数$numは10より大きく、30より小さいです';
    } else {
      echo '条件が成り立ちませんでした';
    }

    // 改行
    echo '<br>';

    $num = 30;

    // ||（または）を記述し、１つでも条件が成り立てば処理を行う
    if ($num === 10 || $num === 30) {
      echo '変数$numは10または30です';
    } else {
      echo '条件が成り立ちませんでした';
    }
    ?>
  </p>
</body>
</html>